https://learn.microsoft.com/en-us/semantic-kernel/prompt-engineering/llm-models

In [3]:
pip install pandas

Collecting pandas
  Downloading pandas-2.0.3-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.4 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.4/12.4 MB 8.7 MB/s eta 0:00:0000:0100:01
Collecting numpy>=1.20.3
  Downloading numpy-1.24.4-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (17.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 17.3/17.3 MB 8.5 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: pytz>=2020.1 in /home/lisheard/miniconda3/envs/py38/lib/python3.8/site-packages (from pandas) (2022.1)
Collecting tzdata>=2022.1
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 341.8/341.8 kB 8.4 MB/s eta 0:00:00a 0:00:01
Requirement already satisfied: python-dateutil>=2.8.2 in /home/lisheard/miniconda3/envs/py38/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /home/lisheard/miniconda3/envs/py38/lib/python3.8/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: tzdata, numpy, pandas
Successfully installed numpy-1.24.4 pandas-2.0.3 tzdata-2023.3
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd

# create a pandas dataframe
df = pd.DataFrame({'name': ["BERT", "GPT-2", "Meena", "GPT-3", "LaMDA", "BLOOM"], 'parameters': [340000000, 1500000000, 2600000000, 175000000000, 137000000000, 176000000000]})

In [7]:
df

    name    parameters
0   BERT     340000000
1  GPT-2    1500000000
2  Meena    2600000000
3  GPT-3  175000000000
4  LaMDA  137000000000
5  BLOOM  176000000000

In [8]:
import math
def radius(area):
    return math.sqrt(area / math.pi)

radius(10.0)

1.7841241161527712

In [23]:
def radius(volume):
    return (3 * volume / (4 * math.pi)) ** (1 / 3)

In [24]:
df['r'] = df.apply(lambda row: radius(row['parameters']), axis=1)

In [25]:
#normalise to smallest:
min = df['r'].min()
df['r_norm'] = df['r']/min

In [26]:
df

    name    parameters            r    r_norm
0   BERT     340000000   432.975613  1.000000
1  GPT-2    1500000000   710.124042  1.640102
2  Meena    2600000000   853.024647  1.970145
3  GPT-3  175000000000  3469.896172  8.014068
4  LaMDA  137000000000  3197.991605  7.386078
5  BLOOM  176000000000  3476.492949  8.029304